MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM3HMFZDFG/mcu.h
/**
 *******************************************************************************
 * @file    TMPM321.h
 * @brief   CMSIS Cortex-M3 Core Peripheral Access Layer Header File for the 
 *          TOSHIBA 'TMPM321' Device Series 
 * @version V2.0.0
 * @date    2010/10/05
 * 
 * THE SOURCE CODE AND ITS RELATED DOCUMENTATION IS PROVIDED "AS IS". TOSHIBA
 * CORPORATION MAKES NO OTHER WARRANTY OF ANY KIND, WHETHER EXPRESS, IMPLIED OR,
 * STATUTORY AND DISCLAIMS ANY AND ALL IMPLIED WARRANTIES OF MERCHANTABILITY,
 * SATISFACTORY QUALITY, NON INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE.
 * 
 * THE SOURCE CODE AND DOCUMENTATION MAY INCLUDE ERRORS. TOSHIBA CORPORATION
 * RESERVES THE RIGHT TO INCORPORATE MODIFICATIONS TO THE SOURCE CODE IN LATER
 * REVISIONS OF IT, AND TO MAKE IMPROVEMENTS OR CHANGES IN THE DOCUMENTATION OR
 * THE PRODUCTS OR TECHNOLOGIES DESCRIBED THEREIN AT ANY TIME.
 * 
 * TOSHIBA CORPORATION SHALL NOT BE LIABLE FOR ANY DIRECT, INDIRECT OR
 * CONSEQUENTIAL DAMAGE OR LIABILITY ARISING FROM YOUR USE OF THE SOURCE CODE OR
 * ANY DOCUMENTATION, INCLUDING BUT NOT LIMITED TO, LOST REVENUES, DATA OR
 * PROFITS, DAMAGES OF ANY SPECIAL, INCIDENTAL OR CONSEQUENTIAL NATURE, PUNITIVE
 * DAMAGES, LOSS OF PROPERTY OR LOSS OF PROFITS ARISING OUT OF OR IN CONNECTION
 * WITH THIS AGREEMENT, OR BEING UNUSABLE, EVEN IF ADVISED OF THE POSSIBILITY OR
 * PROBABILITY OF SUCH DAMAGES AND WHETHER A CLAIM FOR SUCH DAMAGE IS BASED UPON
 * WARRANTY, CONTRACT, TORT, NEGLIGENCE OR OTHERWISE.
 * 
 * (C)Copyright TOSHIBA CORPORATION 2010 All rights reserved
 *******************************************************************************
 */

/** @addtogroup TOSHIBA_TX03_MICROCONTROLLER
  * @{
  */

/** @addtogroup TMPM321
  * @{
  */

#ifndef __TMPM321_H__
#define __TMPM321_H__

#ifdef __cplusplus
extern "C" {
#endif 

/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/** Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M3 Processor Exceptions Numbers ****************************************************/
  NonMaskableInt_IRQn           = -14,      /*!< 2 Non Maskable Interrupt                          */
  HardFault_IRQn                = -13,      /*!< 3 Cortex-M3 Hard Fault Interrupt                  */
  MemoryManagement_IRQn         = -12,      /*!< 4 Cortex-M3 Memory Management Interrupt           */
  BusFault_IRQn                 = -11,      /*!< 5 Cortex-M3 Bus Fault Interrupt                   */
  UsageFault_IRQn               = -10,      /*!< 6 Cortex-M3 Usage Fault Interrupt                 */
  SVCall_IRQn                   = -5,       /*!< 11 Cortex-M3 SV Call Interrupt                    */
  DebugMonitor_IRQn             = -4,       /*!< 12 Cortex-M3 Debug Monitor Interrupt              */
  PendSV_IRQn                   = -2,       /*!< 14 Cortex-M3 Pend SV Interrupt                    */
  SysTick_IRQn                  = -1,       /*!< 15 Cortex-M3 System Tick Interrupt                */

/******  TMPM321 Specific Interrupt Numbers ********************************************************/
  INT0_IRQn                     =  0,       /*!< Interrupt Pin INT0                                */
  INT1_IRQn                     =  1,       /*!< Interrupt Pin INT1                                */
  INT2_IRQn                     =  2,       /*!< Interrupt Pin INT2                                */
  INT3_IRQn                     =  3,       /*!< Interrupt Pin INT3                                */
  INT4_IRQn                     =  4,       /*!< Interrupt Pin INT4                                */
  INT5_IRQn                     =  5,       /*!< Interrupt Pin INT5                                */
  INT6_IRQn                     =  6,       /*!< Interrupt Pin INT6                                */
  INT7_IRQn                     =  7,       /*!< Interrupt Pin INT7                                */

  INTRX0_IRQn                   = 16,       /*!< Serial Reception (Ch 0)                           */
  INTTX0_IRQn                   = 17,       /*!< Serial Transmit (Ch 0)                            */
  INTRX1_IRQn                   = 18,       /*!< Serial Reception (Ch 1)                           */
  INTTX1_IRQn                   = 19,       /*!< Serial Transmit (Ch 1)                            */
  INTRX2_IRQn                   = 20,       /*!< Serial Reception (Ch 2)                           */
  INTTX2_IRQn                   = 21,       /*!< Serial Transmit (Ch 2)                            */
  INTRX3_IRQn                   = 22,       /*!< Serial Reception (Ch 3)                           */
  INTTX3_IRQn                   = 23,       /*!< Serial Transmit (Ch 3)                            */
  INTRX4_IRQn                   = 24,       /*!< Serial Reception (Ch 4)                           */
  INTTX4_IRQn                   = 25,       /*!< Serial Transmit (Ch 4)                            */
  INTSBI0_IRQn                  = 26,       /*!< Serial Bus Interface 0                            */
  INTSBI1_IRQn                  = 27,       /*!< Serial Bus Interface 1                            */
  INTCECRX_IRQn                 = 28,       /*!< CEC Reception                                     */
  INTCECTX_IRQn                 = 29,       /*!< CEC Transmission                                  */
  INTRMCRX0_IRQn                = 30,       /*!< Remote Control Reception 0                        */

  INTRTC_IRQn                   = 32,       /*!< Real Time Clock                                   */
  INTKWUP_IRQn                  = 33,       /*!< Key on wake up                                    */
  INTSBI2_IRQn                  = 34,       /*!< Serial Bus Interface 2                            */
  INTSBI3_IRQn                  = 35,       /*!< Serial Bus Interface 3                            */

  INTADHP_IRQn                  = 37,       /*!< AD Conversion Complete High. Priority             */
  INTADM0_IRQn                  = 38,       /*!< AD Conversion Monitor 0                           */
  INTADM1_IRQn                  = 39,       /*!< AD Conversion Monitor 1                           */
  INTTB0_IRQn                   = 40,       /*!< TMRB Match Detection 0                            */
  INTTB1_IRQn                   = 41,       /*!< TMRB Match Detection 1                            */
  INTTB2_IRQn                   = 42,       /*!< TMRB Match Detection 2                            */
  INTTB3_IRQn                   = 43,       /*!< TMRB Match Detection 3                            */
  INTTB4_IRQn                   = 44,       /*!< TMRB Match Detection 4                            */
  INTTB5_IRQn                   = 45,       /*!< TMRB Match Detection 5                            */
  INTTB6_IRQn                   = 46,       /*!< TMRB Match Detection 6                            */
  INTTB7_IRQn                   = 47,       /*!< TMRB Match Detection 7                            */

  INTUSB_IRQn                   = 56,       /*!< USB Interrupt                                     */

  INTAD_IRQn                    = 58,       /*!< AD Conversion Complete                            */
  INTSSP_IRQn                   = 59,       /*!< Synchronous serial port 0                         */

  INTCAP10_IRQn                 = 74,       /*!< TMRB Input Capture 10                             */
  INTCAP11_IRQn                 = 75,       /*!< TMRB Input Capture 11                             */
  INTCAP20_IRQn                 = 76,       /*!< TMRB Input Capture 20                             */
  INTCAP21_IRQn                 = 77,       /*!< TMRB Input Capture 21                             */

  INTCAP50_IRQn                 = 80,       /*!< TMRB Input Capture 50                             */
  INTCAP51_IRQn                 = 81,       /*!< TMRB Input Capture 51                             */
  INTCAP60_IRQn                 = 82,       /*!< TMRB Input Capture 60                             */
  INTCAP61_IRQn                 = 83,       /*!< TMRB Input Capture 61                             */
  INTCAP70_IRQn                 = 84,       /*!< TMRB Input Capture 70                             */
  INTCAP71_IRQn                 = 85,       /*!< TMRB Input Capture 71                             */

  INTDMACERR_IRQn               = 98,       /*!< DMAC transfer Error                               */
  INTDMACTC0_IRQn               = 99        /*!< DMAC transfer Complete                            */
} IRQn_Type;


