MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM3HMFZDFG/mcu.h
/** Processor and Core Peripheral Section */

/* Configuration of the Cortex-M3 Processor and Core Peripherals */
#define __CM3_REV              0x0200       /*!< Cortex-M3 Core Revision                           */
#define __MPU_PRESENT             0         /*!< MPU present or not                                */
#define __NVIC_PRIO_BITS          3         /*!< Number of Bits used for Priority Levels           */
#define __Vendor_SysTickConfig    0         /*!< Set to 1 if different SysTick Config is used      */

/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm3.h"                       /* Cortex-M3 processor and core peripherals            */
// Note: Changed for MikroE implementation.
// #include "system_TMPM321.h"                 /* TMPM321 System                                      */

/** @addtogroup Device_Peripheral_registers
  * @{
  */

/** Device Specific Peripheral registers structures */

#if defined ( __CC_ARM   )      /* RealView Compiler */
#pragma anon_unions 
#elif (defined (__ICCARM__)) 	/*ICC Compiler       */
#pragma language=extended
#endif

/**
  * @brief Single Master DMAC (DMAC)
  */
typedef struct
{
  __I  uint32_t INTSTATUS;             /*!< DMAC Interrupt Status                             */
  __I  uint32_t INTTCSTATUS;           /*!< DMAC Interrupt Terminal Count Status              */
  __O  uint32_t INTTCCLEAR;            /*!< DMAC Interrupt Terminal Count Clear               */
  __I  uint32_t INTERRORSTATUS;        /*!< DMAC Interrupt Error Status                       */
  __O  uint32_t INTERRCLR;             /*!< DMAC Interrupt Error Clear                        */
  __I  uint32_t RAWINTTCSTATUS;        /*!< DMAC Raw Interrupt Terminal Count Status Register */
  __I  uint32_t RAWINTERRORSTATUS;     /*!< DMAC Raw Error Interrupt Status Register          */
  __I  uint32_t ENBLDCHNS;             /*!< DMAC Enabled Channe Register                      */
  __IO uint32_t SOFTBREQ;              /*!< DMAC Software Burst Request Register              */
  __IO uint32_t SOFTSREQ;              /*!< DMAC Software Single Request Register             */
       uint32_t RESERVED0[2];
  __IO uint32_t CONFIGURATION;         /*!< DMAC Configuration Register                       */
       uint32_t RESERVED1[51];
  __IO uint32_t C0SRCADDR;             /*!< DMAC Channel0 Source Address Register             */
  __IO uint32_t C0DESTADDR;            /*!< DMAC Channel0 Destination Address Register        */
  __IO uint32_t C0LLI;                 /*!< DMAC Channel0 Linked List Item Register           */
  __IO uint32_t C0CONTROL;             /*!< DMAC Channel0 Control Register                    */
  __IO uint32_t C0CONFIGURATION;       /*!< DMAC Channel0 Configuration Register              */
       uint32_t RESERVED2[3];
  __IO uint32_t C1SRCADDR;             /*!< DMAC Channel1 Source Address Register             */
  __IO uint32_t C1DESTADDR;            /*!< DMAC Channel1 Destination Address Register        */
  __IO uint32_t C1LLI;                 /*!< DMAC Channel1 Linked List Item Register           */
  __IO uint32_t C1CONTROL;             /*!< DMAC Channel1 Control Register                    */
  __IO uint32_t C1CONFIGURATION;       /*!< DMAC Channel1 Configuration Register              */
} TSB_DMAC_TypeDef;

/**
  * @brief Synchronous Serial Port(SSP)
  */
typedef struct
{
  __IO uint32_t CR0;                /*!< SSP Control Register 0                    */ 
  __IO uint32_t CR1;                /*!< SSP Control Register 1                    */ 
  __IO uint32_t DR;                 /*!< SSP Data Register                         */ 
  __I  uint32_t SR;                 /*!< SSP Status Register                       */ 
  __IO uint32_t CPSR;               /*!< SSP Clock Prescaler Register              */ 
  __IO uint32_t IMSC;               /*!< SSP Interrupt Mask Set and Clear Register */ 
  __I  uint32_t RIS;                /*!< SSP Raw Interrupt Status Register         */ 
  __I  uint32_t MIS;                /*!< SSP Masked Interrupt Status Register      */ 
  __O  uint32_t ICR;                /*!< SSP Interrupt Clear Register              */ 
  __IO uint32_t DMACR;              /*!< SSP DMA Control Register                  */
} TSB_SSP_TypeDef;


/**
  * @brief General Purpose Input/Output Port (PORT)
  */
typedef struct
{
  __IO uint32_t DATA;               /*!< Port Data Register                 */
  __IO uint32_t CR;                 /*!< Port Control Register              */
  __IO uint32_t FR1;                /*!< Port Function Register 1           */
  __IO uint32_t FR2;                /*!< Port Function Register 2           */
  __IO uint32_t FR3;                /*!< Port Function Register 3           */
       uint32_t RESERVED0[5];
  __IO uint32_t OD;                 /*!< Port Open drain control Register   */
  __IO uint32_t PUP;                /*!< Port Pull up control Register      */
       uint32_t RESERVED1[2];
  __IO uint32_t IE;                 /*!< Port Input control enable Register */
} TSB_PORT_TypeDef;

/**
  * @brief 16-bit Timer/Event Counter (TB)
  */
typedef struct
{
  __IO uint32_t EN;                 /*!< TB Enable Register            */
  __IO uint32_t RUN;                /*!< TB RUN Register               */
  __IO uint32_t CR;                 /*!< TB Control Register           */
  __IO uint32_t MOD;                /*!< TB Mode Register              */
  __IO uint32_t FFCR;               /*!< TB Flip-Flop Control Register */
  __I  uint32_t ST;                 /*!< TB Status Register            */
  __IO uint32_t IM;                 /*!< TB Interrupt Mask Register    */
  __I  uint32_t UC;                 /*!< TB Up Counter Register        */
  __IO uint32_t RG0;                /*!< TB Register 0                 */
  __IO uint32_t RG1;                /*!< TB Register 1                 */
  __I  uint32_t CP0;                /*!< TB Capture register 0         */
  __I  uint32_t CP1;                /*!< TB Capture register 1         */
} TSB_TB_TypeDef;

/**
  * @brief Serial Bus Interface (SBI)
  */
typedef struct
{
  __IO uint32_t CR0;                /*!< SBI Control Register 0       */
  __IO uint32_t CR1;                /*!< SBI Control Register 1       */
  __IO uint32_t DBR;                /*!< SBI Data Buffer Register     */
  __IO uint32_t I2CAR;              /*!< SBI I2C bus Address Register */
  union {
  __O  uint32_t CR2;                /*!< SBI Control Register 2       */
  __I  uint32_t SR;                 /*!< SBI Status Register          */
  };
  __IO uint32_t BR0;                /*!< SBI Baud Rate Register 0     */
} TSB_SBI_TypeDef;

/**
  * @brief General-purpose Serial Interface (SC)
  */
typedef struct
{
  __IO uint32_t EN;                 /*!< SC Enable Register                      */
  __IO uint32_t BUF;                /*!< SC Transmit/ Receive Buffer Register    */
  __IO uint32_t CR;                 /*!< SC Control Register                     */
  __IO uint32_t MOD0;               /*!< SC Mode Control Register 0              */
  __IO uint32_t BRCR;               /*!< SC Baud Rate Generator Control          */
  __IO uint32_t BRADD;              /*!< SC Baud rate Generator Control 2        */
  __IO uint32_t MOD1;               /*!< SC Mode Control Register 1              */
  __IO uint32_t MOD2;               /*!< SC Mode Control Register 2              */
  __IO uint32_t RFC;                /*!< SC Receive FIFO Configuration Register  */
  __IO uint32_t TFC;                /*!< SC Transmit FIFO Configuration Register */
  __I  uint32_t RST;                /*!< SC Receive FIFO Status Register         */
  __I  uint32_t TST;                /*!< SC Transmit FIFO Status Register        */
  __IO uint32_t FCNF;               /*!< SC FIFO Configuration Register          */
} TSB_SC_TypeDef;

/**
  * @brief Consumer Electronics Control (CEC)
  */
typedef struct
{
  __IO uint32_t EN;                 /*!< CEC Enable Register                    */
  __IO uint32_t ADD;                /*!< CEC Logical Address Register           */
  __O  uint32_t RESET;              /*!< CEC Software Reset Register            */
  __IO uint32_t REN;                /*!< CEC Receive Enable Register            */
  __I  uint32_t RBUF;               /*!< CEC Receive Buffer Register            */
  __IO uint32_t RCR1;               /*!< CEC Control Register 1                 */
  __IO uint32_t RCR2;               /*!< CEC Control Register 2                 */
  __IO uint32_t RCR3;               /*!< CEC Control Register 3                 */
  __IO uint32_t TEN;                /*!< CEC Transmit Enable Register           */
  __IO uint32_t TBUF;               /*!< CEC Transmit Buffer Register           */
  __IO uint32_t TCR;                /*!< CEC Transmit Control Register          */
  __I  uint32_t RSTAT;              /*!< CEC Receive Interrupt Status Register  */
  __I  uint32_t TSTAT;              /*!< CEC Transmit Interrupt Status Register */
  __IO uint32_t FSSEL;              /*!< CEC Frequency Select Register          */
} TSB_CEC_TypeDef;

/**
  * @brief Remote Control Signal Preprocessor (RMC)
  */
typedef struct
{
  __IO uint32_t EN;                 /*!< RMC Enable Register                */
  __IO uint32_t REN;                /*!< RMC Receive Enable Register        */
  __I  uint32_t RBUF1;              /*!< RMC Receive Data Buffer Register 1 */
  __I  uint32_t RBUF2;              /*!< RMC Receive Data Buffer Register 2 */
  __I  uint32_t RBUF3;              /*!< RMC Receive Data Buffer Register 3 */
  __IO uint32_t RCR1;               /*!< RMC Control Register 1             */
  __IO uint32_t RCR2;               /*!< RMC Control Register 2             */
  __IO uint32_t RCR3;               /*!< RMC Control Register 3             */
  __IO uint32_t RCR4;               /*!< RMC Control Register 4             */
  __I  uint32_t RSTAT;              /*!< RMC Status Register                */
       uint32_t RESERVED0[3];
  __IO uint32_t FSSEL;              /*!< RMC Frequency Selection Register   */
} TSB_RMC_TypeDef;

/**
  * @brief 10-bit A/D Converter (AD)
  */
typedef struct
{
  __IO uint32_t CLK;                /*!< AD Conversion Clock Setting Register       */
  __IO uint32_t MOD0;               /*!< AD Mode Control Register 0                 */
  __IO uint32_t MOD1;               /*!< AD Mode Control Register 1                 */
  __IO uint32_t MOD2;               /*!< AD Mode Control Register 2                 */
  __IO uint32_t MOD3;               /*!< AD Mode Control Register 3                 */
  __IO uint32_t MOD4;               /*!< AD Mode Control Register 4                 */
  __IO uint32_t MOD5;               /*!< AD Mode Control Register 5                 */
       uint32_t RESERVED0;
  __IO uint32_t CBAS;               /*!< AD Conversion Accuracy Setting Register    */
       uint32_t RESERVED1[3];
  __I  uint32_t REG08;              /*!< AD Conversion Result Register 08L          */
  __I  uint32_t REG19;              /*!< AD Conversion Result Register 19L          */
  __I  uint32_t REG2A;              /*!< AD Conversion Result Register 2AL          */
  __I  uint32_t REG3B;              /*!< AD Conversion Result Register 3BL          */
  __I  uint32_t REG4C;              /*!< AD Conversion Result Register 4CL          */
  __I  uint32_t REG5D;              /*!< AD Conversion Result Register 5DL          */
  __I  uint32_t REG6E;              /*!< AD Conversion Result Register 6EL          */
  __I  uint32_t REG7F;              /*!< AD Conversion Result Register 7FL          */
  __I  uint32_t REGSP;              /*!< AD Conversion Result Register SP           */
  __IO uint32_t CMP0;               /*!< AD Conversion Result Comparison Register 0 */
  __IO uint32_t CMP1;               /*!< AD Conversion Result Comparison Register 1 */
} TSB_AD_TypeDef;

/**
  * @brief Key on Wake Up (KWUP)
  */
typedef struct
{
  __IO uint32_t CR0;                /*!< KWUP Control Register 0           */
  __IO uint32_t CR1;                /*!< KWUP Control Register 1           */
  __IO uint32_t CR2;                /*!< KWUP Control Register 2           */
  __IO uint32_t CR3;                /*!< KWUP Control Register 3           */
       uint32_t RESERVED0[28];
  __I  uint32_t PKEY;               /*!< KWUP Port Monitor Register        */
  __IO uint32_t CNT;                /*!< KWUP Control Register             */
  __O  uint32_t CLR;                /*!< KWUP Interrupt All Clear Register */
  __I  uint32_t INT;                /*!< KWUP Interrupt Monitor Register   */
} TSB_KWUP_TypeDef;

/**
  * @brief Watchdog Timer (WD)
  */
typedef struct
{
  __IO uint32_t MOD;                /*!< WD Mode Register    */
  __O  uint32_t CR;                 /*!< WD Control Register */
} TSB_WD_TypeDef;

/**
  * @brief Real Time Clock (RTC)
  */
typedef struct
{
  __IO uint8_t SECR;               /*!< RTC Second Column Register          */
  __IO uint8_t MINR;               /*!< RTC Minute Column Register          */
  __IO uint8_t HOURR;              /*!< RTC Hour Column Register            */
       uint8_t RESERVED0;
  __IO uint8_t DAYR;               /*!< RTC Day of the Week Column Register */
  __IO uint8_t DATER;              /*!< RTC Day Column Register             */
  __IO uint8_t MONTHR;             /*!< RTC Month Column Register           */
  __IO uint8_t YEARR;              /*!< RTC Year Column Register            */
  __IO uint8_t PAGER;              /*!< RTC PAGE Register                   */
       uint8_t RESERVED1[3];
  __IO uint8_t RESTR;              /*!< RTC Reset Register                  */
} TSB_RTC_TypeDef;

/**
  * @brief Clock Generator (CG)
  */
typedef struct
{
  __IO uint32_t SYSCR;              /*!< System Control Register                  */
  __IO uint32_t OSCCR;              /*!< Oscillation Control Register             */
  __IO uint32_t STBYCR;             /*!< Standby Control Register                 */
  __IO uint32_t PLLSEL;             /*!< PLL Selection Register                   */
  __IO uint32_t CKSEL;              /*!< System Clock Selection Register          */
  __O  uint32_t ICRCG;              /*!< CG Interrupt Request Clear Register      */
  __I  uint32_t NMIFLG;             /*!< NMI Flag Register                        */
  __IO uint32_t RSTFLG;             /*!< Reset Flag Register                      */
  __IO uint32_t IMCGA;              /*!< CG Interrupt Mode Control Register A     */
  __IO uint32_t IMCGB;              /*!< CG Interrupt Mode Control Register B     */
  __IO uint32_t IMCGC;              /*!< CG Interrupt Mode Control Register C     */
  __IO uint32_t IMCGD;              /*!< CG Interrupt Mode Control Register D     */
  __IO uint32_t IMCGE;              /*!< CG Interrupt Mode Control Register E     */
  __IO uint32_t IMCGF;              /*!< CG Interrupt Mode Control Register F     */
} TSB_CG_TypeDef;

/**
  * @brief FLASH Interface (FC)
  */
typedef struct
{
  __IO uint32_t SECBIT;           /*!< Security Bit Register 0  */
       uint32_t RESERVED0[3];
  __I  uint32_t FLCS;             /*!< FLASH Control Register 0 */
} TSB_FC_TypeDef;

